Repository: Gellory/trixiebot
Catalog: resources/locale/*.po
Languages: hu

# A request failed to resolve
source: Uh... I... uhm I think... I might have run into a problem there...? It's not your fault, though...
hu: upsz... lehet, hogy elnéztünk valamit... Több mint valószínű ez nem a te hibád...

# Trixie can't find a list of deleted messages
source: Yeeeeah, nothing found
hu: hááááááááát, semmit sem találtam

# Trixie has cleared her memory of deleted messages.
source: Removed all deleted messages successfully
hu: Az összes üzenet sikeresen törlésre került.

# Trixie lists all available roles below
source: Here's a list of available roles:
hu: Itt van a jelenleg elérhető role-ok listája:

# Part of the !trixie help command
source: `!trixie` to get this help message.
hu: `!trixie` ahhoz, hogy előhívj

# Added new role to !role command
source: Made the role available for everyone! Yay
hu: A role mindenki számává elérhető lett! Yay!

# Added role to a user
source: Role added! /)
hu: Role hozzáadva /)

# Missing permission
source: no
hu: nem

# Requested path is not a file
source: Not a file. Sorry :(
hu: Nem egy fájl. Bocsi :(

# A broadcast from the developer is sent to a server
source: @here Broadcast from creator
hu: @here a fejlesztő közvetít!

# Missing permission to clear/view deleted messages
source: No boi, git gud
hu: Nope ne haragudj haver nem engedem

# User tried to use !timeout without permissions
source: IDK what you're doing here. To use the timeout command you must have permissions to manage messages.
hu: Nem tudom hogy hogy mit akarsz csinálni. Ahhoz, hogy a "bünti" parancsot használd, rendelkezned kell a "manage messages" engedéllyel.

source: Removed all timeouts successfully.
hu: Minden büntetés sikeresen eltávolításra került.

source: You cannot timeout yourself, dummy!
hu: Nem büntizheted magadat, butus!

source: You cannot timeout TrixieBot! I own you.
hu: Nem büntizheted TrixieBotot! Én irányítok!

# Attempted to timeout mods
source: You cannot timeout other moderators or admins. That's just rood
hu: Nem büntethetsz más moderátorokat vagy adminisztrátorokat. Az csak szemétség!

source: Timeout length should be at least 10 seconds long and shorter than 3 days :3
hu: A bünti hossza legalább 10 másodperc legyen de nem lehet hosszabb három napnál! :3

# Sent cat image
source: meow
hu: Mew~

# Called !call hangup to end the call to another server
source: Hung up on them
hu: Hívás befejezve.

# Called !call hangup in server that started the call
source: Hung up and cleared the session
hu: Hívás befejezve és értekezlet feltakarítva.

# There's no active transmission to other servers
source: No call to hang up on
hu: Nincs hívás folyamatban

# Called !call but user not in a voice channel
source: You need to join a voice channel first!
hu: Először voice csatornát kell kreálnod!

# Called !call but there already is an active transmission
source: I only have one muzzle, you know!
hu: Ugye tudod, hogy egyszerre nem lehetek két helyen!

source: No GIFs were found matching this query.
hu: Ezen kritériumokra megfelelő GIF-et nem találtam

# No GIF is trending on Giphy
source: Apparently nothing is trending right now.
hu: Úgy néz ki semmi sem felkapott

# Trixie introduces herself when joining a new server
source: Hi! I'm new here. Let me introduce myself: I'm TrixieBot, a feature rich Discord bot for pony lovers (or losers, your choice) including Derpibooru, e621, Giphy, etc. integration as well as great admin features like timeouting users. I can be your fun little bot or mature server management system :3 Just call `!trixie` if you need help
hu: Üdv! Új vagyok itt. Hadd mutatkozzak be: TrixieBot vagyok, egy különféle funkciókkal teletömöt Discord bot a póniimádók (vagy vesztesek, a te döntésed) részére. A funkcióim részei a Derpibooru, e621, Giphy stb. keressés, továbbá adminisztrációs eszköz is vagyok például a "büntetés" funkció. A vicces robotod lehetek vagy akár komoly szervermoderációs célokra is felhaszálhatsz :3 Segítség: `!trixie`

# A new member joined a server
source: New member joined our Guild, guys!
hu: Egy új taggal gazdagodott a szerverünk!

# A user left the server
source: A soldier has left us
hu: Elvesztettünk egy elvtársat.

source: Hey hey hey. There's already a poll running in this channel. Only one poll in a channel at a time allowed
hu: Hékás! Egszerre egy szavazás folyhat egy csatornában!

# A poll creation error: user didn't format the time the right way
source: `duration` must be formated as in the example.
hu: A szavazás készítése sikertelen; a szavazásnak ebben a formátumban kell megjelennie `hossz`

# The duration of a poll is out of range
source: `duration` should be at least 1m and max 3d
hu: a `hossz` legalább egy perc és maximum három nap lehet

# The user forgot to give two options to vote for
source: To create a poll you must give at least two options to choose from.
hu: Ahhoz hogy szavazást indíts legalább kettő opciót kell megadnod.

source: This server doesn't have any publicly available roles :/
hu: Ez a szerver nem rendelkezik egyetlen nyilvánosan elérhető role-al sem :/

source: Here's a list of available roles:
hu: Itt egy lista az elérhető role-okról:

# User tried to change the role command's configs
source: IDK what you're doing here
hu: Fogalmam sincs mit akartál csinálni

source: Uh apparently this server doesn't have this role available right now.
hu: Uhh úgy néz ki ez a szerver jelenleg nem rendelkezik elérhető role-al.

source: Sorry, you can't add a role to the config that is more powerful than your owns.
hu: Bocsi, de nem változtathatsz meg olyan role-okat amelyek a tiednél magasabb szintűek.

source: Made the role available for everyone! It's free real estate
hu: Ez a role mostantól mindenki számára elérhető! Szabad a gazda!

source: Sorry, you can't remove a role from the config that is more powerful than your owns.
hu: Bocsi, de nem távolíthatsz el olya role-okat amelyek a tiednél magasabb szintűek.

source: Removed the role from the config. Ouchie wouchie ;~;
hu: A role-t eltávolítottam a konfigurációból. ;~;

# User tried to remove role from somebody else
source: IDK what you're doing here, Mister. To use the role command you must have permissions to manage roles.
hu: Nem tudom hogy mit akartál csinálni, de ahhoz hogy ezt a parancsot használd rendelkezned kell a "manage roles" engedéllyel.

source: You cannot remove roles from other users with Manage Roles permission.
hu: Nem tudsz elvenni role-okat más felhasználóktól a "manage roles" engedéllyel.

source: Role removed.
hu: Role eltávolítva.

# User tried to remove rolethey didn't have in the first place
source: Can't remove a role without having it first.
hu: Nem létető role-t nem tudok eltávolítani

source: This role doesn't exist so you can't have it.
hu: Ez a role nem létezik tehát nem kaphatod meg.

source: You don't have permission to remove this role.
hu: Nincs engedélyed arra hogy eltávolítsd ezt a role-t.

source: You cannot add roles to other users with Manage Roles permission.
hu: Nem adhatsz más felhasználóknak role-okat a "manage roles" engedéllyel.

source: Role added! /)
hu: Role hozzáadva! /)

source: You already have this role! Yay?
hu: Már rendelkezel ezzel a role-al! Yay!

# The requested role is not part of the publicly available roles
source: Hmm... I couldn't really find your role.
hu: Hmm... nem tudtam megtalálni a role-odat

# !call got called and Trixie is about to attempt making a call to another server
source: Alright!
hu: Rendben!

# Pinged Trixie
source: pong! Wee hee
hu: ping! Ehehe..!

source: Hugging yourself? How about huggig someone you love!
hu: Magadat ölelgeted? És mi lenne hogyha valaki olyant ölelgetnél akit szeretsz!

source: IDK what you're doing here. To use the mute command you must have permissions to manage messages.
hu: Nem tudom mit szeretnél. Ahhoz hogy a "mute" parancsot használd, rendelkezned kell a "manage messages" engedéllyel.

# a list of blacklisted words follows
source: Currently muted are:
hu: Jelenleg muteolva:

# no words blacklisted yet
source: Nothing yet muted
hu: Semmi sincs muteolva.

source: Removed all muted words successfully
hu: minden muteolt kifejezés sikeresen törölve lett.

source: Removed muted word "{{word}}" successfully
hu: A "{{word}}" sikeresen el lett távolítva a muteolt szavak közül

# a word was already blacklisted
source: Already got this muted
hu: ezt már lemuteoltad.

source: Got it! Blacklisted use of "{{word}}"
hu: Rendben! feketelistázom a/az "{{word}}" szó használatát

# tried to view unknown server config
source: No such parameter. *shrugs*
hu: Nincs ilyen megszabott paraméter *vállat von*

# a list category
source: Other
hu: Másik

source: But no one voted :c
hu: De senki sem szavazott :c

# how many votes on a poll
source: {{votesCount}} vote
hu: {{votesCount}} szavazat

source: {{user}} You've leveled up! **{{level}}**! Ain't that dandy? (This is completely useless right now)
hu: {{user}} Szintet léptél! **{{level}}**! Hát nem király? (Ez jelenleg teljesen haszontalan)

source: everyone has fucking huge diccs k. You're all beautiful
hu: Mindenkinek hatalmas fasza van k. Gyönyörűek vagytok

# length of the penis
source: Length:
hu: Hossz

# girth of the penis
source: Girth:
hu: Körméret

source: `amount` cannot be smaller than 1 or greater than 5!
hu: `amount` nem lehet kisebb 1-nél de 5-nél kevesebbnek kell lennie.

source: Invalid input
hu: Érvénytelen parancs

source: `order` must be either `latest` or `random`!
hu: `order` legalább `latest`vagy `random`!

source: `query` **must** be given
hu: `query` **meg kell** adni

source: The **Great and Powerful Trixie** c-... coul-... *couldn't find anything*. There, I said it...
hu: A **Nagy és Hatalmas Trixie** s-... semm... *semmit sem talált*. Tessék kimondtam!

source: `order` must be either `first`, `latest`, `top` or `random`!
hu: `order` legalább `first`, `latest`, `top` vagy `random`!
