Repository: Gellory/trixiebot
Catalog: assets/locale/*.po
Languages: de

# A request failed to resolve
source: Uh... I... uhm I think... I might have run into a problem there...? It's not your fault, though...
de: Äh... Ich... ähm, ich glaube... es gab da ein Problem...? Es ist aber nicht deine Schuld...

# Trixie can't find a list of deleted messages
source: Yeeeeah, nothing found
de: Tja, nichts gefunden

# Trixie has cleared her memory of deleted messages.
source: Removed all deleted messages successfully
de: Alle gelöschten Nachrichten gecleart

# Trixie lists all available roles below
source: Here's a list of available roles:
de: Hier ist eine Liste verfügbarer Rollen:

# Part of the !trixie help command
source: `!trixie` to get this help message.
de: `!trixie` um diese Hilfsnachricht zu erhalten.

# Added new role to !role command
source: Made the role available for everyone! Yay
de: Hab die Rolle für jeden verfügbar gemacht! Yay

# Added role to a user
source: Role added! /)
de: Rolle geadded!

# Timeouted user %s for the time %s
source: {{users}} is now timeouted for the next {{timeLeft}}
de: {{users}} ist jetzt für die nächsten {{timeLeft}} getimeoutet

# Missing permission
source: no
de: nö

# Requested path is not a file
source: Not a file. Sorry :(
de: Keine Datei. 'Tschuldigung :(

# A broadcast from the developer is sent to a server
source: @here Broadcast from creator
de: @here Broadcast vom Entwickler

# Missing permission to clear/view deleted messages
source: No boi, git gud
de: Ne, versuch's nett erst

# Message sent when timeouted user tries to write
source: {{userMention}} You've been timeouted from writing in this server. Your timeout is over in {{timeLeft}}
de: {{userMention}} Du wurdest vom schreiben in diesem Server getimeoutet! In {{timeLeft}} kann's wieder weiter geh'n

# User tried to use !timeout without permissions
source: IDK what you're doing here. To use the timeout command you must have permissions to manage messages.
de: Also ich weiß ja nicht was du hier zu suchen hast. Um das Timeout Kommando zu nutzen musst du mindestens Nachrichten Verwalten können.

source: Removed all timeouts successfully.
de: Alle Timeouts erfolgreich entfernt.

# Admin removed timeout from a users (%s = list)
source: Removed timeouts for {{user}} successfully. Get dirty~
de: Timeout von {{user}} erfolgreich entfernt. Jetzt kann's weiter geh'n

source: You cannot timeout yourself, dummy!
de: Du kannst dich nicht selber timeouten, Dummkopf!

source: You cannot timeout TrixieBot! I own you.
de: Hast du echt gedacht das würde gehen? Tsk tsk stk

# Attempted to timeout mods
source: You cannot timeout other moderators or admins. That's just rood
de: Du kannst keine anderen Moderatoren oder Admins timeouten. Das ist einfach nur unhöflich

source: Timeout length should be at least 10 seconds long and shorter than 3 days :3
de: Timeoutlänge sollte mindestens 10 Sekunden kurz und maximal 3 Tage lang sein.

# Sent cat image
source: meow
de: Miau

# Sent dog image
source: woof
de: Wuff

# MLEM
source: The chat got mlem'd by {{user}} | Art by n0nnny
de: Der Chat wurde gemlemt von {{user}} | Bild von n0nnny

# BLEP
source: The chat got blep'd by {{user}} | Art by n0nnny
de: Der Chat wurde geblept von {{user}} | Bild von n0nnny

# Called !cider
source: A round of cider is distributed in the chat!
de: Eine Runde Cider wird im Chat verteilt!

# Called !call hangup to end the call to another server
source: Hung up on them
de: Hab aufgelegt

# Called !call hangup in server that started the call
source: Hung up and cleared the session
de: Aufgelegt und Session gecleart

# There's no active transmission to other servers
source: No call to hang up on
de: Kein Anruf zum auflegen

# Called !call but user not in a voice channel
source: You need to join a voice channel first!
de: Du musst erst einem Voicechannel beitreten!

# Called !call but there already is an active transmission
source: I only have one muzzle, you know!
de: Ich hab nur eine Schnautze! Sage mal

source: No GIFs were found matching this query.
de: Keine GIFs auf die Query gefunden.

# No GIF is trending on Giphy
source: Apparently nothing is trending right now.
de: Irgendwie trendet gerade nichts ¯_(ツ)_/¯

# A new member joined a server
source: New member joined our Guild, guys!
de: Ein neues Mitglied ist zu uns gestoßen!

# A new member joined a server. first %s = user tag, second %s = rules channel tag
source: Hey, {{user}} welcome to the baloney server! How 'bout throwing a quick look into {{rulesChannel}}?
de: Hallo, {{user}} willkommen in unserem geilen Server! Wie wer's wenn du mal hier rein guckst: {{rulesChannel}}

# A user left the server
source: A soldier has left us
de: Ein einst strammer Mitstreiter hat und verlassen

# %s is the user tag
source: *{{user}}* left the server. Bye bye
de: *{{user}}* hat den Server verlassen. Bye Bye

source: {{user}} Poll ended!
de: {{user}} Umfrage zuende!

source: Hey hey hey. There's already a poll running in this channel. Only one poll in a channel at a time allowed
de: Ruhig Brauner. In diesem Channel ist schon eine Umfrage am runnen. Nur eine Umfrage pro Channel ist erlaubt, um Verwirrung vorzubeugen

# A poll creation error: user didn't format the time the right way
source: `duration` must be formated as in the example.
de: `duration` muss so formatiert sein wie im Beispiel:

# The duration of a poll is out of range
source: `duration` should be at least 1m and max 3d
de: `duration` muss mindestens 1m und max 3d sein

# The user forgot to give two options to vote for
source: To create a poll you must give at least two options to choose from.
de: Um eine Umfrage zu erstellen musst du zwei oder mehr Optionen angeben!

source: @here Poll is starting! {{timeLeft}} left to vote
de: @here Umfrage hat begonnen! {{timeLeft}} noch um abzustimmen.

# %s is each an option to vote for
source: You vote by simply posting {{options}} in this channel
de: Man wählt, indem man einfach {{options}} in diesen Channel schreibt

source: This server doesn't have any publicly available roles :/
de: In diesem Server gibt es noch keine öffentlichen Rollen :/

source: Here's a list of available roles:
de: Hier ist eine Liste verfügbarer Rollen:

# User tried to change the role command's configs
source: IDK what you're doing here
de: Also ich weiß ja nun gar nicht was du hier zu suchen hast

source: Uh apparently this server doesn't have this role available right now.
de: Ähm, also so wie's aussieht ist diese Rolle gerade nicht verfügbar.

source: Sorry, you can't add a role to the config that is more powerful than your owns.
de: Tschuldigung, aber du kannst keine Rolle der Konfiguration hinzufügen, die höher im Rollenmanager in den Servereinstellungen ist als deine eigene höchte Rolle.

source: Made the role available for everyone! It's free real estate
de: Rolle ist jetzt für jeden verfügbar! Es ist freier Grundbesitz

source: Sorry, you can't remove a role from the config that is more powerful than your owns.
de: Du kannst keine Rolle von der Konfiguration entfernen die mächtiger ist als deine eigenen.

source: Removed the role from the config. Ouchie wouchie ;~;
de: Rolle von der Konfiguration entfernt. Aua

# User tried to remove role from somebody else
source: IDK what you're doing here, Mister. To use the role command you must have permissions to manage roles.
de: Also ich weiß ja nicht was gerade DU hier zu suchen hast, Mister. Um das role Kommando zu nutzen musst du Rollen verwalten dürfen.

source: You cannot remove roles from other users with Manage Roles permission.
de: Du kannst anderen Nutzern die auch Rollen verwalten dürfen nicht ihre Rollen wegnehmen! Bei uns nennt man das Betrug! Ne aber echt, das können sie auch selber machen.

source: Role removed.
de: Rolle entfernt.

# User tried to remove rolethey didn't have in the first place
source: Can't remove a role without having it first.
de: Du kannst dir keine Rolle entnehmen, wenn du sie nichtmal hast :3

source: This role doesn't exist so you can't have it.
de: Diese Rolle existiert nicht. Nach logischer Schlussfolgerung kannst du sie also nicht haben.

source: You don't have permission to remove this role.
de: Du hast keine Erlaubnis diese Rolle zu entfernen.

source: You cannot add roles to other users with Manage Roles permission.
de: Du kannst anderen Nutzern die auch Rollen verwalten dürfen keine Rollen zuteilen! Das können sie auch selber machen.

source: Role added! /)
de: Rolle geadded!

source: You already have this role! Yay?
de: Du hast diese Rolle schon! Yay?

# The requested role is not part of the publicly available roles
source: Hmm... I couldn't really find your role.
de: Weird... ich konnte diese Rolle nicht finden.

# !call got called and Trixie is about to attempt making a call to another server
source: Alright!
de: Aber hundert!

# Pinged Trixie
source: pong! Wee hee
de: pong! Juhuu

source: Hugging yourself? How about huggig someone you love!
de: Wieder mal am sich-selbst-umarmen? Wie wär's wenn du anderen mal die Liebe zuteil kommen tusts!

source: IDK what you're doing here. To use the mute command you must have permissions to manage messages.
de: Also ich weiß ja nun nicht was du hier machts, ja. Um das mute Command zu benutzen brauchst du Rechte Nachrichten zu verwalten, ja.

# a list of blacklisted words follows
source: Currently muted are:
de: Gerade gemuted sind:

# no words blacklisted yet
source: Nothing yet muted
de: Noch nüscht gemuted

source: Removed all muted words successfully
de: Alle gemuteten Wörter entfernt!

source: Removed muted word "{{word}}" successfully
de: Gemutetes Wort "{{word}}" entmuted!!

# a word was already blacklisted
source: Already got this muted
de: Wir ham das schon gemuted

source: Got it! Blacklisted use of "{{word}}"
de: Schon verstanden! Du willst also, dass ich "{{word}}" mute? Schon erledigt!

# tried to view unknown server config
source: No such parameter. *shrugs*
de: Keine solche Einstellung vorhanden. *schulter zuck*

# a list category
source: Other
de: Andere

source: But no one voted :c
de: Aber niemand hat gevotet :c

source: {{user}} You've leveled up! **{{level}}**! Ain't that dandy? (This is completely useless right now)
de: {{user}} Du hast soeben gelevelt! **{{level}}**! Ist das nicht verrückt? (Das ist grad noch abolut nutzlos)

source: everyone has fucking huge diccs k. You're all beautiful
de: JEDER HAT OMG VERDAMMT RIESIGE SCHWÄNZE. Sie sind so schön °˖✧◝(⁰▿⁰)◜✧˖°

# length of the penis
source: Length:
de: Länge:

# girth of the penis
source: Girth:
de: Umfang:

source: `amount` cannot be smaller than 1 or greater than 5!
de: `amount` kann nicht kleiner als 1 oder größer als 5 sein!

source: Invalid input
de: Ungültiger Input

source: `order` must be either `latest` or `random`!
de: `order` muss entweder `latest` oder `random` sein!

source: `query` **must** be given
de: `query` **muss* gegeben sein

source: The **Great and Powerful Trixie** c-... coul-... *couldn't find anything*. There, I said it...
de: Tja, dumm gelaufen. Ich hab da nicht so wirklich was gefunden? Tut mir auch leid und so

source: `order` must be either `first`, `latest`, `top` or `random`!
de: `order` muss entweder `first`, `latest`, `top` oder `random` sein!

source: Changed locale for the server to {{locale}}
de: Sprache des Servers geändert zu {{locale}}

source: Changed locale for {{channel}} to {{locale}}
de: Sprache von {{channel}} in {{locale}} geändert

source: @here {{user}} is live!
de: @here {{user}} ist live!

source: Hehe, nothing here lol. Time to add some.
de: Hehe, nichts hier lül. Zeit Alerts hinzuzufügen.
